NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e/nrf7120e_flpr.svd
          <register>
            <name>PERMMASK</name>
            <description>Description cluster: Masks permission setting fields from register OVERRIDE.PERM</description>
            <addressOffset>0x14</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>READ</name>
                <description>Read mask</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Masked</name>
                    <description>Permission setting READ in OVERRIDE register will not be applied</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UnMasked</name>
                    <description>Permission setting READ in OVERRIDE register will be applied</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE</name>
                <description>Write mask</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Masked</name>
                    <description>Permission setting WRITE in OVERRIDE register will not be applied</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UnMasked</name>
                    <description>Permission setting WRITE in OVERRIDE register will be applied</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EXECUTE</name>
                <description>Execute mask</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Masked</name>
                    <description>Permission setting EXECUTE in OVERRIDE register will not be applied</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UnMasked</name>
                    <description>Permission setting EXECUTE in OVERRIDE register will be applied</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECATTR</name>
                <description>Security mapping mask</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Masked</name>
                    <description>Permission setting SECATTR in OVERRIDE register will not be applied</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UnMasked</name>
                    <description>Permission setting SECATTR in OVERRIDE register will be applied</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PRIVL</name>
                <description>Privileged mask</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Masked</name>
                    <description>Permission setting PRIVL in OVERRIDE register will not be applied</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>UnMasked</name>
                    <description>Permission setting PRIVL in OVERRIDE register will be applied</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_DPPIC00_NS</name>
      <description>Distributed programmable peripheral interconnect controller 0</description>
      <baseAddress>0x40042000</baseAddress>
      <alternatePeripheral>GLOBAL_USBHSCORE_NS</alternatePeripheral>
      <headerStructName>DPPIC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>DPPIC</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>TASKS_CHG[%s]</name>
          <description>Channel group tasks</description>
          <headerStructName>DPPIC_TASKS_CHG</headerStructName>
          <access>write-only</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <name>EN</name>
            <description>Description cluster: Enable channel group n</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable channel group n</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Trigger</name>
                    <description>Trigger task</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DIS</name>
            <description>Description cluster: Disable channel group n</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DIS</name>
                <description>Disable channel group n</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Trigger</name>
                    <description>Trigger task</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>SUBSCRIBE_CHG[%s]</name>
          <description>Subscribe configuration for tasks</description>
          <headerStructName>DPPIC_SUBSCRIBE_CHG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x080</addressOffset>
          <register>
            <name>EN</name>
            <description>Description cluster: Subscribe configuration for task CHG[n].EN</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CHIDX</name>
                <description>DPPI channel that task CHG[n].EN will subscribe to</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable subscription</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable subscription</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DIS</name>
            <description>Description cluster: Subscribe configuration for task CHG[n].DIS</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CHIDX</name>
                <description>DPPI channel that task CHG[n].DIS will subscribe to</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>EN</name>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable subscription</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable subscription</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
